#include<iostream>
using namespace std;

int moren(int a,int b=10,int c=20){
    return a+b+c;
}
//函数的默认参数
//注意，如果某个位置有默认参数，则后面的数据都必须要有默认参数

//--------------------------------------------------------
void zhanwei(int a,int){
    cout<<"le"<<endl;
}
//函数的占位参数
//--------------------------------------------------------

void myn(){
    cout<<"mynn"<<endl;
}
void myn(int a){
    cout<<"xgz"<<endl;
}
//函数重载的条件：同一区域，统一名称，参数类型不同或个数不同或顺序不同（注：无返回值类型）
//--------------------------------------------------------------------------------






int main(){
    cout<<moren(10,20)<<endl;//a=10,b=10被覆盖为20，c=20，得50


    zhanwei(10,10);


    myn();
    myn(1);//这俩互不影响


    

    return 0;
}